/* automatically generated by rust-bindgen 0.59.1 */

extern crate core;

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

#[doc = "< DMA2 Channel 3 global Interrupt"]
pub const IRQn_Type_DMA2_Channel3_IRQn: IRQn_Type = 58;
#[doc = "< DMA2 Channel 4 global Interrupt"]
pub const IRQn_Type_DMA2_Channel4_IRQn: IRQn_Type = 59;
#[doc = "< DMA2 Channel 5 global Interrupt"]
pub const IRQn_Type_DMA2_Channel5_IRQn: IRQn_Type = 60;
#[doc = "< DFSDM1 Filter 0 global Interrupt"]
pub const IRQn_Type_DFSDM1_FLT0_IRQn: IRQn_Type = 61;
#[doc = "< DFSDM1 Filter 1 global Interrupt"]
pub const IRQn_Type_DFSDM1_FLT1_IRQn: IRQn_Type = 62;
#[doc = "< DFSDM1 Filter 2 global Interrupt"]
pub const IRQn_Type_DFSDM1_FLT2_IRQn: IRQn_Type = 63;
#[doc = "< COMP1 and COMP2 Interrupts"]
pub const IRQn_Type_COMP_IRQn: IRQn_Type = 64;
#[doc = "< LP TIM1 interrupt"]
pub const IRQn_Type_LPTIM1_IRQn: IRQn_Type = 65;
#[doc = "< LP TIM2 interrupt"]
pub const IRQn_Type_LPTIM2_IRQn: IRQn_Type = 66;
#[doc = "< USB OTG FS global Interrupt"]
pub const IRQn_Type_OTG_FS_IRQn: IRQn_Type = 67;
#[doc = "< DMA2 Channel 6 global interrupt"]
pub const IRQn_Type_DMA2_Channel6_IRQn: IRQn_Type = 68;
#[doc = "< DMA2 Channel 7 global interrupt"]
pub const IRQn_Type_DMA2_Channel7_IRQn: IRQn_Type = 69;
#[doc = "< LP UART1 interrupt"]
pub const IRQn_Type_LPUART1_IRQn: IRQn_Type = 70;
#[doc = "< Quad SPI global interrupt"]
pub const IRQn_Type_QUADSPI_IRQn: IRQn_Type = 71;
#[doc = "< I2C3 event interrupt"]
pub const IRQn_Type_I2C3_EV_IRQn: IRQn_Type = 72;
#[doc = "< I2C3 error interrupt"]
pub const IRQn_Type_I2C3_ER_IRQn: IRQn_Type = 73;
#[doc = "< Serial Audio Interface 1 global interrupt"]
pub const IRQn_Type_SAI1_IRQn: IRQn_Type = 74;
#[doc = "< Serial Audio Interface 2 global interrupt"]
pub const IRQn_Type_SAI2_IRQn: IRQn_Type = 75;
#[doc = "< Serial Wire Interface 1 global interrupt"]
pub const IRQn_Type_SWPMI1_IRQn: IRQn_Type = 76;
#[doc = "< Touch Sense Controller global interrupt"]
pub const IRQn_Type_TSC_IRQn: IRQn_Type = 77;
#[doc = "< RNG global interrupt"]
pub const IRQn_Type_RNG_IRQn: IRQn_Type = 80;
#[doc = "< FPU global interrupt"]
pub const IRQn_Type_FPU_IRQn: IRQn_Type = 81;
#[doc = " @brief STM32L4XX Interrupt Number Definition, according to the selected device"]
#[doc = "        in @ref Library_configuration_section"]
pub type IRQn_Type = libc::c_int;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = libc::c_longlong;
pub type uintmax_t = libc::c_ulonglong;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT16_WRITE {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_WRITE() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_WRITE>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT16_WRITE>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT16_READ {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_READ() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_READ>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT16_READ>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32_WRITE {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_WRITE() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_WRITE>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32_WRITE>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32_READ {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_READ() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_READ>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32_READ>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    pub b: APSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type__bindgen_ty_1))
    );
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        GE: u32,
        _reserved1: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::core::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 7u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(w)
        )
    );
}
impl Default for APSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    pub b: IPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type__bindgen_ty_1))
    );
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
impl Default for IPSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    pub b: xPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type__bindgen_ty_1))
    );
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ICI_IT_1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_ICI_IT_1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ICI_IT_2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ICI_IT_2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        ICI_IT_1: u32,
        GE: u32,
        _reserved1: u32,
        T: u32,
        ICI_IT_2: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 6u8, {
            let ICI_IT_1: u32 = unsafe { ::core::mem::transmute(ICI_IT_1) };
            ICI_IT_1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::core::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 2u8, {
            let ICI_IT_2: u32 = unsafe { ::core::mem::transmute(ICI_IT_2) };
            ICI_IT_2 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
impl Default for xPSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    pub b: CONTROL_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FPCA(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FPCA(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        FPCA: u32,
        _reserved0: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::core::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FPCA: u32 = unsafe { ::core::mem::transmute(FPCA) };
            FPCA as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(w)
        )
    );
}
impl Default for CONTROL_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVIC_Type {
    pub ISER: [u32; 8usize],
    pub RESERVED0: [u32; 24usize],
    pub ICER: [u32; 8usize],
    pub RESERVED1: [u32; 24usize],
    pub ISPR: [u32; 8usize],
    pub RESERVED2: [u32; 24usize],
    pub ICPR: [u32; 8usize],
    pub RESERVED3: [u32; 24usize],
    pub IABR: [u32; 8usize],
    pub RESERVED4: [u32; 56usize],
    pub IP: [u8; 240usize],
    pub RESERVED5: [u32; 644usize],
    pub STIR: u32,
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    assert_eq!(
        ::core::mem::size_of::<NVIC_Type>(),
        3588usize,
        concat!("Size of: ", stringify!(NVIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<NVIC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(NVIC_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICER as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED1 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISPR as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED2 as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICPR as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED3 as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).IABR as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IABR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED4 as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).IP as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED5 as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).STIR as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(STIR)
        )
    );
}
impl Default for NVIC_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCB_Type {
    pub CPUID: u32,
    pub ICSR: u32,
    pub VTOR: u32,
    pub AIRCR: u32,
    pub SCR: u32,
    pub CCR: u32,
    pub SHP: [u8; 12usize],
    pub SHCSR: u32,
    pub CFSR: u32,
    pub HFSR: u32,
    pub DFSR: u32,
    pub MMFAR: u32,
    pub BFAR: u32,
    pub AFSR: u32,
    pub PFR: [u32; 2usize],
    pub DFR: u32,
    pub ADR: u32,
    pub MMFR: [u32; 4usize],
    pub ISAR: [u32; 5usize],
    pub RESERVED0: [u32; 5usize],
    pub CPACR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    assert_eq!(
        ::core::mem::size_of::<SCB_Type>(),
        140usize,
        concat!("Size of: ", stringify!(SCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CPUID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPUID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ICSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ICSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).VTOR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(VTOR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).AIRCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AIRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SCR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHP as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHCSR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CFSR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).HFSR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(HFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).DFSR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).MMFAR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).BFAR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(BFAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).AFSR as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).PFR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(PFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).DFR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ADR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ADR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).MMFR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ISAR as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ISAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).RESERVED0 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CPACR as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPACR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCnSCB_Type {
    pub RESERVED0: [u32; 1usize],
    pub ICTR: u32,
    pub ACTLR: u32,
}
#[test]
fn bindgen_test_layout_SCnSCB_Type() {
    assert_eq!(
        ::core::mem::size_of::<SCnSCB_Type>(),
        12usize,
        concat!("Size of: ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCnSCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).RESERVED0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).ICTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ICTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).ACTLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ACTLR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SysTick_Type {
    pub CTRL: u32,
    pub LOAD: u32,
    pub VAL: u32,
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    assert_eq!(
        ::core::mem::size_of::<SysTick_Type>(),
        16usize,
        concat!("Size of: ", stringify!(SysTick_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SysTick_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SysTick_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CTRL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).LOAD as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(LOAD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).VAL as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(VAL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CALIB as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CALIB)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ITM_Type {
    pub PORT: [ITM_Type__bindgen_ty_1; 32usize],
    pub RESERVED0: [u32; 864usize],
    pub TER: u32,
    pub RESERVED1: [u32; 15usize],
    pub TPR: u32,
    pub RESERVED2: [u32; 15usize],
    pub TCR: u32,
    pub RESERVED3: [u32; 32usize],
    pub RESERVED4: [u32; 43usize],
    pub LAR: u32,
    pub LSR: u32,
    pub RESERVED5: [u32; 6usize],
    pub PID4: u32,
    pub PID5: u32,
    pub PID6: u32,
    pub PID7: u32,
    pub PID0: u32,
    pub PID1: u32,
    pub PID2: u32,
    pub PID3: u32,
    pub CID0: u32,
    pub CID1: u32,
    pub CID2: u32,
    pub CID3: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ITM_Type__bindgen_ty_1 {
    pub u8_: u8,
    pub u16_: u16,
    pub u32_: u32,
}
#[test]
fn bindgen_test_layout_ITM_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u8_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u8_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u16_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u16_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u32_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u32_)
        )
    );
}
impl Default for ITM_Type__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_ITM_Type() {
    assert_eq!(
        ::core::mem::size_of::<ITM_Type>(),
        4096usize,
        concat!("Size of: ", stringify!(ITM_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ITM_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PORT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PORT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED0 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TER as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED1 as *const _ as usize },
        3588usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TPR as *const _ as usize },
        3648usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED2 as *const _ as usize },
        3652usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TCR as *const _ as usize },
        3712usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED3 as *const _ as usize },
        3716usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED4 as *const _ as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).LAR as *const _ as usize },
        4016usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).LSR as *const _ as usize },
        4020usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED5 as *const _ as usize },
        4024usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID4 as *const _ as usize },
        4048usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID5 as *const _ as usize },
        4052usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID6 as *const _ as usize },
        4056usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID7 as *const _ as usize },
        4060usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID0 as *const _ as usize },
        4064usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID1 as *const _ as usize },
        4068usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID2 as *const _ as usize },
        4072usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID3 as *const _ as usize },
        4076usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID0 as *const _ as usize },
        4080usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID1 as *const _ as usize },
        4084usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID2 as *const _ as usize },
        4088usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID3 as *const _ as usize },
        4092usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID3)
        )
    );
}
impl Default for ITM_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DWT_Type {
    pub CTRL: u32,
    pub CYCCNT: u32,
    pub CPICNT: u32,
    pub EXCCNT: u32,
    pub SLEEPCNT: u32,
    pub LSUCNT: u32,
    pub FOLDCNT: u32,
    pub PCSR: u32,
    pub COMP0: u32,
    pub MASK0: u32,
    pub FUNCTION0: u32,
    pub RESERVED0: [u32; 1usize],
    pub COMP1: u32,
    pub MASK1: u32,
    pub FUNCTION1: u32,
    pub RESERVED1: [u32; 1usize],
    pub COMP2: u32,
    pub MASK2: u32,
    pub FUNCTION2: u32,
    pub RESERVED2: [u32; 1usize],
    pub COMP3: u32,
    pub MASK3: u32,
    pub FUNCTION3: u32,
}
#[test]
fn bindgen_test_layout_DWT_Type() {
    assert_eq!(
        ::core::mem::size_of::<DWT_Type>(),
        92usize,
        concat!("Size of: ", stringify!(DWT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DWT_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DWT_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CTRL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CYCCNT as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CYCCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CPICNT as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CPICNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).EXCCNT as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(EXCCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).SLEEPCNT as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(SLEEPCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).LSUCNT as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(LSUCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FOLDCNT as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FOLDCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).PCSR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(PCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION0 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED0 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP1 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK1 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED1 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP2 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK2 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION2 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED2 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP3 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK3 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION3 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TPI_Type {
    pub SSPSR: u32,
    pub CSPSR: u32,
    pub RESERVED0: [u32; 2usize],
    pub ACPR: u32,
    pub RESERVED1: [u32; 55usize],
    pub SPPR: u32,
    pub RESERVED2: [u32; 131usize],
    pub FFSR: u32,
    pub FFCR: u32,
    pub FSCR: u32,
    pub RESERVED3: [u32; 759usize],
    pub TRIGGER: u32,
    pub FIFO0: u32,
    pub ITATBCTR2: u32,
    pub RESERVED4: [u32; 1usize],
    pub ITATBCTR0: u32,
    pub FIFO1: u32,
    pub ITCTRL: u32,
    pub RESERVED5: [u32; 39usize],
    pub CLAIMSET: u32,
    pub CLAIMCLR: u32,
    pub RESERVED7: [u32; 8usize],
    pub DEVID: u32,
    pub DEVTYPE: u32,
}
#[test]
fn bindgen_test_layout_TPI_Type() {
    assert_eq!(
        ::core::mem::size_of::<TPI_Type>(),
        4048usize,
        concat!("Size of: ", stringify!(TPI_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<TPI_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(TPI_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).SSPSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SSPSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CSPSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CSPSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ACPR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ACPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).SPPR as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SPPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED2 as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FFSR as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FFCR as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FSCR as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED3 as *const _ as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).TRIGGER as *const _ as usize },
        3816usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(TRIGGER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FIFO0 as *const _ as usize },
        3820usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITATBCTR2 as *const _ as usize },
        3824usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED4 as *const _ as usize },
        3828usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITATBCTR0 as *const _ as usize },
        3832usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FIFO1 as *const _ as usize },
        3836usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITCTRL as *const _ as usize },
        3840usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED5 as *const _ as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CLAIMSET as *const _ as usize },
        4000usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMSET)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CLAIMCLR as *const _ as usize },
        4004usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMCLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED7 as *const _ as usize },
        4008usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).DEVID as *const _ as usize },
        4040usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).DEVTYPE as *const _ as usize },
        4044usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVTYPE)
        )
    );
}
impl Default for TPI_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MPU_Type {
    pub TYPE: u32,
    pub CTRL: u32,
    pub RNR: u32,
    pub RBAR: u32,
    pub RASR: u32,
    pub RBAR_A1: u32,
    pub RASR_A1: u32,
    pub RBAR_A2: u32,
    pub RASR_A2: u32,
    pub RBAR_A3: u32,
    pub RASR_A3: u32,
}
#[test]
fn bindgen_test_layout_MPU_Type() {
    assert_eq!(
        ::core::mem::size_of::<MPU_Type>(),
        44usize,
        concat!("Size of: ", stringify!(MPU_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<MPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(MPU_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).TYPE as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(TYPE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).CTRL as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RNR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RNR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A2 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A3 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A3 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FPU_Type {
    pub RESERVED0: [u32; 1usize],
    pub FPCCR: u32,
    pub FPCAR: u32,
    pub FPDSCR: u32,
    pub MVFR0: u32,
    pub MVFR1: u32,
    pub MVFR2: u32,
}
#[test]
fn bindgen_test_layout_FPU_Type() {
    assert_eq!(
        ::core::mem::size_of::<FPU_Type>(),
        28usize,
        concat!("Size of: ", stringify!(FPU_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<FPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(FPU_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).RESERVED0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPCCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPCAR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPDSCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPDSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).MVFR0 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).MVFR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).MVFR2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CoreDebug_Type {
    pub DHCSR: u32,
    pub DCRSR: u32,
    pub DCRDR: u32,
    pub DEMCR: u32,
}
#[test]
fn bindgen_test_layout_CoreDebug_Type() {
    assert_eq!(
        ::core::mem::size_of::<CoreDebug_Type>(),
        16usize,
        concat!("Size of: ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CoreDebug_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DHCSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DHCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DCRSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DCRDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DEMCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DEMCR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ARM_MPU_Region_t {
    pub RBAR: u32,
    pub RASR: u32,
}
#[test]
fn bindgen_test_layout_ARM_MPU_Region_t() {
    assert_eq!(
        ::core::mem::size_of::<ARM_MPU_Region_t>(),
        8usize,
        concat!("Size of: ", stringify!(ARM_MPU_Region_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ARM_MPU_Region_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ARM_MPU_Region_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ARM_MPU_Region_t>())).RBAR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ARM_MPU_Region_t),
            "::",
            stringify!(RBAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ARM_MPU_Region_t>())).RASR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ARM_MPU_Region_t),
            "::",
            stringify!(RASR)
        )
    );
}
extern "C" {
    pub static mut ITM_RxBuffer: i32;
}
extern "C" {
    #[doc = "< System Clock Frequency (Core Clock)"]
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    #[doc = "< AHB prescalers table values"]
    pub static AHBPrescTable: [u8; 16usize];
}
extern "C" {
    #[doc = "< APB prescalers table values"]
    pub static APBPrescTable: [u8; 8usize];
}
extern "C" {
    #[doc = "< MSI ranges table values"]
    pub static MSIRangeTable: [u32; 12usize];
}
extern "C" {
    #[doc = " @addtogroup STM32L4xx_System_Exported_Functions"]
    #[doc = " @{"]
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[doc = " @brief Analog to Digital Converter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ADC_TypeDef {
    #[doc = "< ADC interrupt and status register,             Address offset: 0x00"]
    pub ISR: u32,
    #[doc = "< ADC interrupt enable register,                 Address offset: 0x04"]
    pub IER: u32,
    #[doc = "< ADC control register,                          Address offset: 0x08"]
    pub CR: u32,
    #[doc = "< ADC configuration register 1,                  Address offset: 0x0C"]
    pub CFGR: u32,
    #[doc = "< ADC configuration register 2,                  Address offset: 0x10"]
    pub CFGR2: u32,
    #[doc = "< ADC sampling time register 1,                  Address offset: 0x14"]
    pub SMPR1: u32,
    #[doc = "< ADC sampling time register 2,                  Address offset: 0x18"]
    pub SMPR2: u32,
    #[doc = "< Reserved,                                                      0x1C"]
    pub RESERVED1: u32,
    #[doc = "< ADC analog watchdog 1 threshold register,      Address offset: 0x20"]
    pub TR1: u32,
    #[doc = "< ADC analog watchdog 2 threshold register,      Address offset: 0x24"]
    pub TR2: u32,
    #[doc = "< ADC analog watchdog 3 threshold register,      Address offset: 0x28"]
    pub TR3: u32,
    #[doc = "< Reserved,                                                      0x2C"]
    pub RESERVED2: u32,
    #[doc = "< ADC group regular sequencer register 1,        Address offset: 0x30"]
    pub SQR1: u32,
    #[doc = "< ADC group regular sequencer register 2,        Address offset: 0x34"]
    pub SQR2: u32,
    #[doc = "< ADC group regular sequencer register 3,        Address offset: 0x38"]
    pub SQR3: u32,
    #[doc = "< ADC group regular sequencer register 4,        Address offset: 0x3C"]
    pub SQR4: u32,
    #[doc = "< ADC group regular data register,               Address offset: 0x40"]
    pub DR: u32,
    #[doc = "< Reserved,                                                      0x44"]
    pub RESERVED3: u32,
    #[doc = "< Reserved,                                                      0x48"]
    pub RESERVED4: u32,
    #[doc = "< ADC group injected sequencer register,         Address offset: 0x4C"]
    pub JSQR: u32,
    #[doc = "< Reserved,                                               0x50 - 0x5C"]
    pub RESERVED5: [u32; 4usize],
    #[doc = "< ADC offset register 1,                         Address offset: 0x60"]
    pub OFR1: u32,
    #[doc = "< ADC offset register 2,                         Address offset: 0x64"]
    pub OFR2: u32,
    #[doc = "< ADC offset register 3,                         Address offset: 0x68"]
    pub OFR3: u32,
    #[doc = "< ADC offset register 4,                         Address offset: 0x6C"]
    pub OFR4: u32,
    #[doc = "< Reserved,                                               0x70 - 0x7C"]
    pub RESERVED6: [u32; 4usize],
    #[doc = "< ADC group injected rank 1 data register,       Address offset: 0x80"]
    pub JDR1: u32,
    #[doc = "< ADC group injected rank 2 data register,       Address offset: 0x84"]
    pub JDR2: u32,
    #[doc = "< ADC group injected rank 3 data register,       Address offset: 0x88"]
    pub JDR3: u32,
    #[doc = "< ADC group injected rank 4 data register,       Address offset: 0x8C"]
    pub JDR4: u32,
    #[doc = "< Reserved,                                             0x090 - 0x09C"]
    pub RESERVED7: [u32; 4usize],
    #[doc = "< ADC analog watchdog 1 configuration register,  Address offset: 0xA0"]
    pub AWD2CR: u32,
    #[doc = "< ADC analog watchdog 3 Configuration Register,  Address offset: 0xA4"]
    pub AWD3CR: u32,
    #[doc = "< Reserved,                                                     0x0A8"]
    pub RESERVED8: u32,
    #[doc = "< Reserved,                                                     0x0AC"]
    pub RESERVED9: u32,
    #[doc = "< ADC differential mode selection register,      Address offset: 0xB0"]
    pub DIFSEL: u32,
    #[doc = "< ADC calibration factors,                       Address offset: 0xB4"]
    pub CALFACT: u32,
}
#[test]
fn bindgen_test_layout_ADC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<ADC_TypeDef>(),
        184usize,
        concat!("Size of: ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).ISR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).IER as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CFGR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CFGR2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CFGR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SMPR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SMPR2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).TR1 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(TR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).TR2 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(TR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).TR3 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(TR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED2 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR1 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR2 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR3 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR4 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).DR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED3 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED4 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JSQR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JSQR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED5 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).OFR1 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).OFR2 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).OFR3 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).OFR4 as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(OFR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED6 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR1 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR2 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR3 as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR4 as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED7 as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).AWD2CR as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(AWD2CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).AWD3CR as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(AWD3CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED8 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).RESERVED9 as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(RESERVED9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).DIFSEL as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(DIFSEL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CALFACT as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CALFACT)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ADC_Common_TypeDef {
    #[doc = "< ADC common status register,                    Address offset: ADC1 base address + 0x300"]
    pub CSR: u32,
    #[doc = "< Reserved,                                      Address offset: ADC1 base address + 0x304"]
    pub RESERVED: u32,
    #[doc = "< ADC common configuration register,             Address offset: ADC1 base address + 0x308"]
    pub CCR: u32,
    #[doc = "< ADC common group regular data register         Address offset: ADC1 base address + 0x30C"]
    pub CDR: u32,
}
#[test]
fn bindgen_test_layout_ADC_Common_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<ADC_Common_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(ADC_Common_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_Common_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_Common_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).RESERVED as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(RESERVED)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CCR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CDR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CDR)
        )
    );
}
#[doc = " @brief Controller Area Network TxMailBox"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CAN_TxMailBox_TypeDef {
    #[doc = "< CAN TX mailbox identifier register"]
    pub TIR: u32,
    #[doc = "< CAN mailbox data length control and time stamp register"]
    pub TDTR: u32,
    #[doc = "< CAN mailbox data low register"]
    pub TDLR: u32,
    #[doc = "< CAN mailbox data high register"]
    pub TDHR: u32,
}
#[test]
fn bindgen_test_layout_CAN_TxMailBox_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CAN_TxMailBox_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(CAN_TxMailBox_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CAN_TxMailBox_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_TxMailBox_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TxMailBox_TypeDef>())).TIR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TxMailBox_TypeDef),
            "::",
            stringify!(TIR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TxMailBox_TypeDef>())).TDTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TxMailBox_TypeDef),
            "::",
            stringify!(TDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TxMailBox_TypeDef>())).TDLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TxMailBox_TypeDef),
            "::",
            stringify!(TDLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TxMailBox_TypeDef>())).TDHR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TxMailBox_TypeDef),
            "::",
            stringify!(TDHR)
        )
    );
}
#[doc = " @brief Controller Area Network FIFOMailBox"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CAN_FIFOMailBox_TypeDef {
    #[doc = "< CAN receive FIFO mailbox identifier register"]
    pub RIR: u32,
    #[doc = "< CAN receive FIFO mailbox data length control and time stamp register"]
    pub RDTR: u32,
    #[doc = "< CAN receive FIFO mailbox data low register"]
    pub RDLR: u32,
    #[doc = "< CAN receive FIFO mailbox data high register"]
    pub RDHR: u32,
}
#[test]
fn bindgen_test_layout_CAN_FIFOMailBox_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CAN_FIFOMailBox_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(CAN_FIFOMailBox_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CAN_FIFOMailBox_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_FIFOMailBox_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FIFOMailBox_TypeDef>())).RIR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FIFOMailBox_TypeDef),
            "::",
            stringify!(RIR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FIFOMailBox_TypeDef>())).RDTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FIFOMailBox_TypeDef),
            "::",
            stringify!(RDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FIFOMailBox_TypeDef>())).RDLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FIFOMailBox_TypeDef),
            "::",
            stringify!(RDLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FIFOMailBox_TypeDef>())).RDHR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FIFOMailBox_TypeDef),
            "::",
            stringify!(RDHR)
        )
    );
}
#[doc = " @brief Controller Area Network FilterRegister"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CAN_FilterRegister_TypeDef {
    #[doc = "< CAN Filter bank register 1"]
    pub FR1: u32,
    #[doc = "< CAN Filter bank register 1"]
    pub FR2: u32,
}
#[test]
fn bindgen_test_layout_CAN_FilterRegister_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CAN_FilterRegister_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(CAN_FilterRegister_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CAN_FilterRegister_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_FilterRegister_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FilterRegister_TypeDef>())).FR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FilterRegister_TypeDef),
            "::",
            stringify!(FR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_FilterRegister_TypeDef>())).FR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_FilterRegister_TypeDef),
            "::",
            stringify!(FR2)
        )
    );
}
#[doc = " @brief Controller Area Network"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CAN_TypeDef {
    #[doc = "< CAN master control register,         Address offset: 0x00"]
    pub MCR: u32,
    #[doc = "< CAN master status register,          Address offset: 0x04"]
    pub MSR: u32,
    #[doc = "< CAN transmit status register,        Address offset: 0x08"]
    pub TSR: u32,
    #[doc = "< CAN receive FIFO 0 register,         Address offset: 0x0C"]
    pub RF0R: u32,
    #[doc = "< CAN receive FIFO 1 register,         Address offset: 0x10"]
    pub RF1R: u32,
    #[doc = "< CAN interrupt enable register,       Address offset: 0x14"]
    pub IER: u32,
    #[doc = "< CAN error status register,           Address offset: 0x18"]
    pub ESR: u32,
    #[doc = "< CAN bit timing register,             Address offset: 0x1C"]
    pub BTR: u32,
    #[doc = "< Reserved, 0x020 - 0x17F"]
    pub RESERVED0: [u32; 88usize],
    #[doc = "< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC"]
    pub sTxMailBox: [CAN_TxMailBox_TypeDef; 3usize],
    #[doc = "< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC"]
    pub sFIFOMailBox: [CAN_FIFOMailBox_TypeDef; 2usize],
    #[doc = "< Reserved, 0x1D0 - 0x1FF"]
    pub RESERVED1: [u32; 12usize],
    #[doc = "< CAN filter master register,          Address offset: 0x200"]
    pub FMR: u32,
    #[doc = "< CAN filter mode register,            Address offset: 0x204"]
    pub FM1R: u32,
    #[doc = "< Reserved, 0x208"]
    pub RESERVED2: u32,
    #[doc = "< CAN filter scale register,           Address offset: 0x20C"]
    pub FS1R: u32,
    #[doc = "< Reserved, 0x210"]
    pub RESERVED3: u32,
    #[doc = "< CAN filter FIFO assignment register, Address offset: 0x214"]
    pub FFA1R: u32,
    #[doc = "< Reserved, 0x218"]
    pub RESERVED4: u32,
    #[doc = "< CAN filter activation register,      Address offset: 0x21C"]
    pub FA1R: u32,
    #[doc = "< Reserved, 0x220-0x23F"]
    pub RESERVED5: [u32; 8usize],
    #[doc = "< CAN Filter Register,                 Address offset: 0x240-0x31C"]
    pub sFilterRegister: [CAN_FilterRegister_TypeDef; 28usize],
}
#[test]
fn bindgen_test_layout_CAN_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CAN_TypeDef>(),
        800usize,
        concat!("Size of: ", stringify!(CAN_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CAN_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).MCR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(MCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).MSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(MSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).TSR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(TSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RF0R as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RF0R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RF1R as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RF1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).IER as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).ESR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(ESR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).BTR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(BTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).sTxMailBox as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(sTxMailBox)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).sFIFOMailBox as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(sFIFOMailBox)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED1 as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).FMR as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(FMR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).FM1R as *const _ as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(FM1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED2 as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).FS1R as *const _ as usize },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(FS1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED3 as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).FFA1R as *const _ as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(FFA1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED4 as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).FA1R as *const _ as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(FA1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).RESERVED5 as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CAN_TypeDef>())).sFilterRegister as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_TypeDef),
            "::",
            stringify!(sFilterRegister)
        )
    );
}
impl Default for CAN_TypeDef {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Comparator"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct COMP_TypeDef {
    #[doc = "< COMP control and status register, Address offset: 0x00"]
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_COMP_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<COMP_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(COMP_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<COMP_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(COMP_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<COMP_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COMP_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct COMP_Common_TypeDef {
    #[doc = "< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00"]
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_COMP_Common_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<COMP_Common_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(COMP_Common_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<COMP_Common_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(COMP_Common_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<COMP_Common_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COMP_Common_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
}
#[doc = " @brief CRC calculation unit"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CRC_TypeDef {
    #[doc = "< CRC Data register,                           Address offset: 0x00"]
    pub DR: u32,
    #[doc = "< CRC Independent data register,               Address offset: 0x04"]
    pub IDR: u8,
    #[doc = "< Reserved,                                                    0x05"]
    pub RESERVED0: u8,
    #[doc = "< Reserved,                                                    0x06"]
    pub RESERVED1: u16,
    #[doc = "< CRC Control register,                        Address offset: 0x08"]
    pub CR: u32,
    #[doc = "< Reserved,                                                    0x0C"]
    pub RESERVED2: u32,
    #[doc = "< Initial CRC value register,                  Address offset: 0x10"]
    pub INIT: u32,
    #[doc = "< CRC polynomial register,                     Address offset: 0x14"]
    pub POL: u32,
}
#[test]
fn bindgen_test_layout_CRC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CRC_TypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).DR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).IDR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).RESERVED0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).RESERVED1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).CR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).RESERVED2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).INIT as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(INIT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).POL as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(POL)
        )
    );
}
#[doc = " @brief Digital to Analog Converter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DAC_TypeDef {
    #[doc = "< DAC control register,                                    Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< DAC software trigger register,                           Address offset: 0x04"]
    pub SWTRIGR: u32,
    #[doc = "< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08"]
    pub DHR12R1: u32,
    #[doc = "< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C"]
    pub DHR12L1: u32,
    #[doc = "< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10"]
    pub DHR8R1: u32,
    #[doc = "< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14"]
    pub DHR12R2: u32,
    #[doc = "< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18"]
    pub DHR12L2: u32,
    #[doc = "< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C"]
    pub DHR8R2: u32,
    #[doc = "< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20"]
    pub DHR12RD: u32,
    #[doc = "< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24"]
    pub DHR12LD: u32,
    #[doc = "< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28"]
    pub DHR8RD: u32,
    #[doc = "< DAC channel1 data output register,                       Address offset: 0x2C"]
    pub DOR1: u32,
    #[doc = "< DAC channel2 data output register,                       Address offset: 0x30"]
    pub DOR2: u32,
    #[doc = "< DAC status register,                                     Address offset: 0x34"]
    pub SR: u32,
    #[doc = "< DAC calibration control register,                        Address offset: 0x38"]
    pub CCR: u32,
    #[doc = "< DAC mode control register,                               Address offset: 0x3C"]
    pub MCR: u32,
    #[doc = "< DAC Sample and Hold sample time register 1,              Address offset: 0x40"]
    pub SHSR1: u32,
    #[doc = "< DAC Sample and Hold sample time register 2,              Address offset: 0x44"]
    pub SHSR2: u32,
    #[doc = "< DAC Sample and Hold hold time register,                  Address offset: 0x48"]
    pub SHHR: u32,
    #[doc = "< DAC Sample and Hold refresh time register,               Address offset: 0x4C"]
    pub SHRR: u32,
}
#[test]
fn bindgen_test_layout_DAC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DAC_TypeDef>(),
        80usize,
        concat!("Size of: ", stringify!(DAC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DAC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SWTRIGR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SWTRIGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12R1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12R1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12L1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12L1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR8R1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8R1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12R2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12R2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12L2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12L2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR8R2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8R2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12RD as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12RD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR12LD as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR12LD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DHR8RD as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DHR8RD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DOR1 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DOR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).DOR2 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(DOR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).CCR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).MCR as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(MCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SHSR1 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHSR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SHSR2 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHSR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SHHR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHHR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_TypeDef>())).SHRR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_TypeDef),
            "::",
            stringify!(SHRR)
        )
    );
}
#[doc = " @brief DFSDM module registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DFSDM_Filter_TypeDef {
    #[doc = "< DFSDM control register1,                          Address offset: 0x100"]
    pub FLTCR1: u32,
    #[doc = "< DFSDM control register2,                          Address offset: 0x104"]
    pub FLTCR2: u32,
    #[doc = "< DFSDM interrupt and status register,              Address offset: 0x108"]
    pub FLTISR: u32,
    #[doc = "< DFSDM interrupt flag clear register,              Address offset: 0x10C"]
    pub FLTICR: u32,
    #[doc = "< DFSDM injected channel group selection register,  Address offset: 0x110"]
    pub FLTJCHGR: u32,
    #[doc = "< DFSDM filter control register,                    Address offset: 0x114"]
    pub FLTFCR: u32,
    #[doc = "< DFSDM data register for injected group,           Address offset: 0x118"]
    pub FLTJDATAR: u32,
    #[doc = "< DFSDM data register for regular group,            Address offset: 0x11C"]
    pub FLTRDATAR: u32,
    #[doc = "< DFSDM analog watchdog high threshold register,    Address offset: 0x120"]
    pub FLTAWHTR: u32,
    #[doc = "< DFSDM analog watchdog low threshold register,     Address offset: 0x124"]
    pub FLTAWLTR: u32,
    #[doc = "< DFSDM analog watchdog status register             Address offset: 0x128"]
    pub FLTAWSR: u32,
    #[doc = "< DFSDM analog watchdog clear flag register         Address offset: 0x12C"]
    pub FLTAWCFR: u32,
    #[doc = "< DFSDM extreme detector maximum register,          Address offset: 0x130"]
    pub FLTEXMAX: u32,
    #[doc = "< DFSDM extreme detector minimum register           Address offset: 0x134"]
    pub FLTEXMIN: u32,
    #[doc = "< DFSDM conversion timer,                           Address offset: 0x138"]
    pub FLTCNVTIMR: u32,
}
#[test]
fn bindgen_test_layout_DFSDM_Filter_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DFSDM_Filter_TypeDef>(),
        60usize,
        concat!("Size of: ", stringify!(DFSDM_Filter_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DFSDM_Filter_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DFSDM_Filter_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTCR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTCR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTCR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTCR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTISR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTICR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTJCHGR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTJCHGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTFCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTFCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTJDATAR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTJDATAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTRDATAR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTRDATAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTAWHTR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTAWHTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTAWLTR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTAWLTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTAWSR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTAWSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTAWCFR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTAWCFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTEXMAX as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTEXMAX)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTEXMIN as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTEXMIN)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<DFSDM_Filter_TypeDef>())).FLTCNVTIMR as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Filter_TypeDef),
            "::",
            stringify!(FLTCNVTIMR)
        )
    );
}
#[doc = " @brief DFSDM channel configuration registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DFSDM_Channel_TypeDef {
    #[doc = "< DFSDM channel configuration register1,            Address offset: 0x00"]
    pub CHCFGR1: u32,
    #[doc = "< DFSDM channel configuration register2,            Address offset: 0x04"]
    pub CHCFGR2: u32,
    #[doc = "< DFSDM channel analog watchdog and"]
    #[doc = "short circuit detector register,                  Address offset: 0x08"]
    pub CHAWSCDR: u32,
    #[doc = "< DFSDM channel watchdog filter data register,      Address offset: 0x0C"]
    pub CHWDATAR: u32,
    #[doc = "< DFSDM channel data input register,                Address offset: 0x10"]
    pub CHDATINR: u32,
}
#[test]
fn bindgen_test_layout_DFSDM_Channel_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DFSDM_Channel_TypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(DFSDM_Channel_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DFSDM_Channel_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DFSDM_Channel_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Channel_TypeDef>())).CHCFGR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Channel_TypeDef),
            "::",
            stringify!(CHCFGR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Channel_TypeDef>())).CHCFGR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Channel_TypeDef),
            "::",
            stringify!(CHCFGR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Channel_TypeDef>())).CHAWSCDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Channel_TypeDef),
            "::",
            stringify!(CHAWSCDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Channel_TypeDef>())).CHWDATAR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Channel_TypeDef),
            "::",
            stringify!(CHWDATAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DFSDM_Channel_TypeDef>())).CHDATINR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DFSDM_Channel_TypeDef),
            "::",
            stringify!(CHDATINR)
        )
    );
}
#[doc = " @brief Debug MCU"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DBGMCU_TypeDef {
    #[doc = "< MCU device ID code,                 Address offset: 0x00"]
    pub IDCODE: u32,
    #[doc = "< Debug MCU configuration register,   Address offset: 0x04"]
    pub CR: u32,
    #[doc = "< Debug MCU APB1 freeze register 1,   Address offset: 0x08"]
    pub APB1FZR1: u32,
    #[doc = "< Debug MCU APB1 freeze register 2,   Address offset: 0x0C"]
    pub APB1FZR2: u32,
    #[doc = "< Debug MCU APB2 freeze register,     Address offset: 0x10"]
    pub APB2FZ: u32,
}
#[test]
fn bindgen_test_layout_DBGMCU_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DBGMCU_TypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(DBGMCU_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DBGMCU_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DBGMCU_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).IDCODE as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(IDCODE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).CR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).APB1FZR1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(APB1FZR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).APB1FZR2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(APB1FZR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).APB2FZ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(APB2FZ)
        )
    );
}
#[doc = " @brief DMA Controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_Channel_TypeDef {
    #[doc = "< DMA channel x configuration register"]
    pub CCR: u32,
    #[doc = "< DMA channel x number of data register"]
    pub CNDTR: u32,
    #[doc = "< DMA channel x peripheral address register"]
    pub CPAR: u32,
    #[doc = "< DMA channel x memory address register"]
    pub CMAR: u32,
}
#[test]
fn bindgen_test_layout_DMA_Channel_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DMA_Channel_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(DMA_Channel_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_Channel_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_Channel_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Channel_TypeDef>())).CCR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Channel_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Channel_TypeDef>())).CNDTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Channel_TypeDef),
            "::",
            stringify!(CNDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Channel_TypeDef>())).CPAR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Channel_TypeDef),
            "::",
            stringify!(CPAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Channel_TypeDef>())).CMAR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Channel_TypeDef),
            "::",
            stringify!(CMAR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_TypeDef {
    #[doc = "< DMA interrupt status register,                 Address offset: 0x00"]
    pub ISR: u32,
    #[doc = "< DMA interrupt flag clear register,             Address offset: 0x04"]
    pub IFCR: u32,
}
#[test]
fn bindgen_test_layout_DMA_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DMA_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(DMA_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).ISR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).IFCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(IFCR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_Request_TypeDef {
    #[doc = "< DMA channel selection register"]
    pub CSELR: u32,
}
#[test]
fn bindgen_test_layout_DMA_Request_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DMA_Request_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(DMA_Request_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_Request_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_Request_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Request_TypeDef>())).CSELR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Request_TypeDef),
            "::",
            stringify!(CSELR)
        )
    );
}
#[doc = " @brief External Interrupt/Event Controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EXTI_TypeDef {
    #[doc = "< EXTI Interrupt mask register 1,             Address offset: 0x00"]
    pub IMR1: u32,
    #[doc = "< EXTI Event mask register 1,                 Address offset: 0x04"]
    pub EMR1: u32,
    #[doc = "< EXTI Rising trigger selection register 1,   Address offset: 0x08"]
    pub RTSR1: u32,
    #[doc = "< EXTI Falling trigger selection register 1,  Address offset: 0x0C"]
    pub FTSR1: u32,
    #[doc = "< EXTI Software interrupt event register 1,   Address offset: 0x10"]
    pub SWIER1: u32,
    #[doc = "< EXTI Pending register 1,                    Address offset: 0x14"]
    pub PR1: u32,
    #[doc = "< Reserved, 0x18"]
    pub RESERVED1: u32,
    #[doc = "< Reserved, 0x1C"]
    pub RESERVED2: u32,
    #[doc = "< EXTI Interrupt mask register 2,             Address offset: 0x20"]
    pub IMR2: u32,
    #[doc = "< EXTI Event mask register 2,                 Address offset: 0x24"]
    pub EMR2: u32,
    #[doc = "< EXTI Rising trigger selection register 2,   Address offset: 0x28"]
    pub RTSR2: u32,
    #[doc = "< EXTI Falling trigger selection register 2,  Address offset: 0x2C"]
    pub FTSR2: u32,
    #[doc = "< EXTI Software interrupt event register 2,   Address offset: 0x30"]
    pub SWIER2: u32,
    #[doc = "< EXTI Pending register 2,                    Address offset: 0x34"]
    pub PR2: u32,
}
#[test]
fn bindgen_test_layout_EXTI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<EXTI_TypeDef>(),
        56usize,
        concat!("Size of: ", stringify!(EXTI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<EXTI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(EXTI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).IMR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(IMR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).EMR1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(EMR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).RTSR1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(RTSR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).FTSR1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(FTSR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).SWIER1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(SWIER1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).PR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(PR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).RESERVED1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).RESERVED2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).IMR2 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(IMR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).EMR2 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(EMR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).RTSR2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(RTSR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).FTSR2 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(FTSR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).SWIER2 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(SWIER2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).PR2 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(PR2)
        )
    );
}
#[doc = " @brief Firewall"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FIREWALL_TypeDef {
    #[doc = "< Code Segment Start Address register,              Address offset: 0x00"]
    pub CSSA: u32,
    #[doc = "< Code Segment Length register,                      Address offset: 0x04"]
    pub CSL: u32,
    #[doc = "< NON volatile data Segment Start Address register,  Address offset: 0x08"]
    pub NVDSSA: u32,
    #[doc = "< NON volatile data Segment Length register,         Address offset: 0x0C"]
    pub NVDSL: u32,
    #[doc = "< Volatile data Segment Start Address register,      Address offset: 0x10"]
    pub VDSSA: u32,
    #[doc = "< Volatile data Segment Length register,             Address offset: 0x14"]
    pub VDSL: u32,
    #[doc = "< Reserved1,                                         Address offset: 0x18"]
    pub RESERVED1: u32,
    #[doc = "< Reserved2,                                         Address offset: 0x1C"]
    pub RESERVED2: u32,
    #[doc = "< Configuration  register,                           Address offset: 0x20"]
    pub CR: u32,
}
#[test]
fn bindgen_test_layout_FIREWALL_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FIREWALL_TypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(FIREWALL_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FIREWALL_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FIREWALL_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).CSSA as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(CSSA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).CSL as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(CSL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).NVDSSA as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(NVDSSA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).NVDSL as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(NVDSL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).VDSSA as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(VDSSA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).VDSL as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(VDSL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).RESERVED1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).RESERVED2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FIREWALL_TypeDef>())).CR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FIREWALL_TypeDef),
            "::",
            stringify!(CR)
        )
    );
}
#[doc = " @brief FLASH Registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FLASH_TypeDef {
    #[doc = "< FLASH access control register,            Address offset: 0x00"]
    pub ACR: u32,
    #[doc = "< FLASH power down key register,            Address offset: 0x04"]
    pub PDKEYR: u32,
    #[doc = "< FLASH key register,                       Address offset: 0x08"]
    pub KEYR: u32,
    #[doc = "< FLASH option key register,                Address offset: 0x0C"]
    pub OPTKEYR: u32,
    #[doc = "< FLASH status register,                    Address offset: 0x10"]
    pub SR: u32,
    #[doc = "< FLASH control register,                   Address offset: 0x14"]
    pub CR: u32,
    #[doc = "< FLASH ECC register,                       Address offset: 0x18"]
    pub ECCR: u32,
    #[doc = "< Reserved1,                                Address offset: 0x1C"]
    pub RESERVED1: u32,
    #[doc = "< FLASH option register,                    Address offset: 0x20"]
    pub OPTR: u32,
    #[doc = "< FLASH bank1 PCROP start address register, Address offset: 0x24"]
    pub PCROP1SR: u32,
    #[doc = "< FLASH bank1 PCROP end address register,   Address offset: 0x28"]
    pub PCROP1ER: u32,
    #[doc = "< FLASH bank1 WRP area A address register,  Address offset: 0x2C"]
    pub WRP1AR: u32,
    #[doc = "< FLASH bank1 WRP area B address register,  Address offset: 0x30"]
    pub WRP1BR: u32,
    #[doc = "< Reserved2,                           Address offset: 0x34-0x40"]
    pub RESERVED2: [u32; 4usize],
    #[doc = "< FLASH bank2 PCROP start address register, Address offset: 0x44"]
    pub PCROP2SR: u32,
    #[doc = "< FLASH bank2 PCROP end address register,   Address offset: 0x48"]
    pub PCROP2ER: u32,
    #[doc = "< FLASH bank2 WRP area A address register,  Address offset: 0x4C"]
    pub WRP2AR: u32,
    #[doc = "< FLASH bank2 WRP area B address register,  Address offset: 0x50"]
    pub WRP2BR: u32,
}
#[test]
fn bindgen_test_layout_FLASH_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FLASH_TypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(FLASH_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FLASH_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).ACR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(ACR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).PDKEYR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(PDKEYR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).KEYR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(KEYR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).OPTKEYR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(OPTKEYR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).SR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).CR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).ECCR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(ECCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).RESERVED1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).OPTR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(OPTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).PCROP1SR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(PCROP1SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).PCROP1ER as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(PCROP1ER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).WRP1AR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(WRP1AR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).WRP1BR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(WRP1BR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).RESERVED2 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).PCROP2SR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(PCROP2SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).PCROP2ER as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(PCROP2ER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).WRP2AR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(WRP2AR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).WRP2BR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(WRP2BR)
        )
    );
}
#[doc = " @brief Flexible Memory Controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FMC_Bank1_TypeDef {
    #[doc = "< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C"]
    pub BTCR: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_FMC_Bank1_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank1_TypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(FMC_Bank1_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank1_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FMC_Bank1_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank1_TypeDef>())).BTCR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank1_TypeDef),
            "::",
            stringify!(BTCR)
        )
    );
}
#[doc = " @brief Flexible Memory Controller Bank1E"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FMC_Bank1E_TypeDef {
    #[doc = "< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C"]
    pub BWTR: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_FMC_Bank1E_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank1E_TypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(FMC_Bank1E_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank1E_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FMC_Bank1E_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank1E_TypeDef>())).BWTR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank1E_TypeDef),
            "::",
            stringify!(BWTR)
        )
    );
}
#[doc = " @brief Flexible Memory Controller Bank3"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FMC_Bank3_TypeDef {
    #[doc = "< NAND Flash control register,                       Address offset: 0x80"]
    pub PCR: u32,
    #[doc = "< NAND Flash FIFO status and interrupt register,     Address offset: 0x84"]
    pub SR: u32,
    #[doc = "< NAND Flash Common memory space timing register,    Address offset: 0x88"]
    pub PMEM: u32,
    #[doc = "< NAND Flash Attribute memory space timing register, Address offset: 0x8C"]
    pub PATT: u32,
    #[doc = "< Reserved, 0x90"]
    pub RESERVED0: u32,
    #[doc = "< NAND Flash ECC result registers,                   Address offset: 0x94"]
    pub ECCR: u32,
}
#[test]
fn bindgen_test_layout_FMC_Bank3_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FMC_Bank3_TypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(FMC_Bank3_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FMC_Bank3_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FMC_Bank3_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).PCR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(PCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).SR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).PMEM as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(PMEM)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).PATT as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(PATT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).RESERVED0 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FMC_Bank3_TypeDef>())).ECCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMC_Bank3_TypeDef),
            "::",
            stringify!(ECCR)
        )
    );
}
#[doc = " @brief General Purpose I/O"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GPIO_TypeDef {
    #[doc = "< GPIO port mode register,               Address offset: 0x00"]
    pub MODER: u32,
    #[doc = "< GPIO port output type register,        Address offset: 0x04"]
    pub OTYPER: u32,
    #[doc = "< GPIO port output speed register,       Address offset: 0x08"]
    pub OSPEEDR: u32,
    #[doc = "< GPIO port pull-up/pull-down register,  Address offset: 0x0C"]
    pub PUPDR: u32,
    #[doc = "< GPIO port input data register,         Address offset: 0x10"]
    pub IDR: u32,
    #[doc = "< GPIO port output data register,        Address offset: 0x14"]
    pub ODR: u32,
    #[doc = "< GPIO port bit set/reset  register,     Address offset: 0x18"]
    pub BSRR: u32,
    #[doc = "< GPIO port configuration lock register, Address offset: 0x1C"]
    pub LCKR: u32,
    #[doc = "< GPIO alternate function registers,     Address offset: 0x20-0x24"]
    pub AFR: [u32; 2usize],
    #[doc = "< GPIO Bit Reset register,               Address offset: 0x28"]
    pub BRR: u32,
    #[doc = "< GPIO analog switch control register,   Address offset: 0x2C"]
    pub ASCR: u32,
}
#[test]
fn bindgen_test_layout_GPIO_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<GPIO_TypeDef>(),
        48usize,
        concat!("Size of: ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<GPIO_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).MODER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(MODER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).OTYPER as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OTYPER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).OSPEEDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OSPEEDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).PUPDR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(PUPDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).IDR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).ODR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(ODR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).BSRR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(BSRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).LCKR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(LCKR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).AFR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(AFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).BRR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(BRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).ASCR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(ASCR)
        )
    );
}
#[doc = " @brief Inter-integrated Circuit Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct I2C_TypeDef {
    #[doc = "< I2C Control register 1,            Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< I2C Control register 2,            Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< I2C Own address 1 register,        Address offset: 0x08"]
    pub OAR1: u32,
    #[doc = "< I2C Own address 2 register,        Address offset: 0x0C"]
    pub OAR2: u32,
    #[doc = "< I2C Timing register,               Address offset: 0x10"]
    pub TIMINGR: u32,
    #[doc = "< I2C Timeout register,              Address offset: 0x14"]
    pub TIMEOUTR: u32,
    #[doc = "< I2C Interrupt and status register, Address offset: 0x18"]
    pub ISR: u32,
    #[doc = "< I2C Interrupt clear register,      Address offset: 0x1C"]
    pub ICR: u32,
    #[doc = "< I2C PEC register,                  Address offset: 0x20"]
    pub PECR: u32,
    #[doc = "< I2C Receive data register,         Address offset: 0x24"]
    pub RXDR: u32,
    #[doc = "< I2C Transmit data register,        Address offset: 0x28"]
    pub TXDR: u32,
}
#[test]
fn bindgen_test_layout_I2C_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<I2C_TypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<I2C_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).OAR1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).OAR2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).TIMINGR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TIMINGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).TIMEOUTR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TIMEOUTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).ISR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).ICR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).PECR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(PECR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).RXDR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(RXDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).TXDR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TXDR)
        )
    );
}
#[doc = " @brief Independent WATCHDOG"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IWDG_TypeDef {
    #[doc = "< IWDG Key register,       Address offset: 0x00"]
    pub KR: u32,
    #[doc = "< IWDG Prescaler register, Address offset: 0x04"]
    pub PR: u32,
    #[doc = "< IWDG Reload register,    Address offset: 0x08"]
    pub RLR: u32,
    #[doc = "< IWDG Status register,    Address offset: 0x0C"]
    pub SR: u32,
    #[doc = "< IWDG Window register,    Address offset: 0x10"]
    pub WINR: u32,
}
#[test]
fn bindgen_test_layout_IWDG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<IWDG_TypeDef>(),
        20usize,
        concat!("Size of: ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<IWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).KR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(KR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).PR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(PR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).RLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(RLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).SR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).WINR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(WINR)
        )
    );
}
#[doc = " @brief LPTIMER"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LPTIM_TypeDef {
    #[doc = "< LPTIM Interrupt and Status register,                Address offset: 0x00"]
    pub ISR: u32,
    #[doc = "< LPTIM Interrupt Clear register,                     Address offset: 0x04"]
    pub ICR: u32,
    #[doc = "< LPTIM Interrupt Enable register,                    Address offset: 0x08"]
    pub IER: u32,
    #[doc = "< LPTIM Configuration register,                       Address offset: 0x0C"]
    pub CFGR: u32,
    #[doc = "< LPTIM Control register,                             Address offset: 0x10"]
    pub CR: u32,
    #[doc = "< LPTIM Compare register,                             Address offset: 0x14"]
    pub CMP: u32,
    #[doc = "< LPTIM Autoreload register,                          Address offset: 0x18"]
    pub ARR: u32,
    #[doc = "< LPTIM Counter register,                             Address offset: 0x1C"]
    pub CNT: u32,
    #[doc = "< LPTIM Option register,                              Address offset: 0x20"]
    pub OR: u32,
}
#[test]
fn bindgen_test_layout_LPTIM_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<LPTIM_TypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(LPTIM_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<LPTIM_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(LPTIM_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).ISR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).ICR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).IER as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).CFGR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).CR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).CMP as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(CMP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).ARR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(ARR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).CNT as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(CNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<LPTIM_TypeDef>())).OR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(LPTIM_TypeDef),
            "::",
            stringify!(OR)
        )
    );
}
#[doc = " @brief Operational Amplifier (OPAMP)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OPAMP_TypeDef {
    #[doc = "< OPAMP control/status register,                     Address offset: 0x00"]
    pub CSR: u32,
    #[doc = "< OPAMP offset trimming register for normal mode,    Address offset: 0x04"]
    pub OTR: u32,
    #[doc = "< OPAMP offset trimming register for low power mode, Address offset: 0x08"]
    pub LPOTR: u32,
}
#[test]
fn bindgen_test_layout_OPAMP_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<OPAMP_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(OPAMP_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<OPAMP_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(OPAMP_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OPAMP_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OPAMP_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OPAMP_TypeDef>())).OTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OPAMP_TypeDef),
            "::",
            stringify!(OTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OPAMP_TypeDef>())).LPOTR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OPAMP_TypeDef),
            "::",
            stringify!(LPOTR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OPAMP_Common_TypeDef {
    #[doc = "< OPAMP control/status register, used for bits common to several OPAMP instances, Address offset: 0x00"]
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_OPAMP_Common_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<OPAMP_Common_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(OPAMP_Common_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<OPAMP_Common_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(OPAMP_Common_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OPAMP_Common_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OPAMP_Common_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
}
#[doc = " @brief Power Control"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PWR_TypeDef {
    #[doc = "< PWR power control register 1,        Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< PWR power control register 2,        Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< PWR power control register 3,        Address offset: 0x08"]
    pub CR3: u32,
    #[doc = "< PWR power control register 4,        Address offset: 0x0C"]
    pub CR4: u32,
    #[doc = "< PWR power status register 1,         Address offset: 0x10"]
    pub SR1: u32,
    #[doc = "< PWR power status register 2,         Address offset: 0x14"]
    pub SR2: u32,
    #[doc = "< PWR power status reset register,     Address offset: 0x18"]
    pub SCR: u32,
    #[doc = "< Reserved,                            Address offset: 0x1C"]
    pub RESERVED: u32,
    #[doc = "< Pull_up control register of portA,   Address offset: 0x20"]
    pub PUCRA: u32,
    #[doc = "< Pull_Down control register of portA, Address offset: 0x24"]
    pub PDCRA: u32,
    #[doc = "< Pull_up control register of portB,   Address offset: 0x28"]
    pub PUCRB: u32,
    #[doc = "< Pull_Down control register of portB, Address offset: 0x2C"]
    pub PDCRB: u32,
    #[doc = "< Pull_up control register of portC,   Address offset: 0x30"]
    pub PUCRC: u32,
    #[doc = "< Pull_Down control register of portC, Address offset: 0x34"]
    pub PDCRC: u32,
    #[doc = "< Pull_up control register of portD,   Address offset: 0x38"]
    pub PUCRD: u32,
    #[doc = "< Pull_Down control register of portD, Address offset: 0x3C"]
    pub PDCRD: u32,
    #[doc = "< Pull_up control register of portE,   Address offset: 0x40"]
    pub PUCRE: u32,
    #[doc = "< Pull_Down control register of portE, Address offset: 0x44"]
    pub PDCRE: u32,
    #[doc = "< Pull_up control register of portF,   Address offset: 0x48"]
    pub PUCRF: u32,
    #[doc = "< Pull_Down control register of portF, Address offset: 0x4C"]
    pub PDCRF: u32,
    #[doc = "< Pull_up control register of portG,   Address offset: 0x50"]
    pub PUCRG: u32,
    #[doc = "< Pull_Down control register of portG, Address offset: 0x54"]
    pub PDCRG: u32,
    #[doc = "< Pull_up control register of portH,   Address offset: 0x58"]
    pub PUCRH: u32,
    #[doc = "< Pull_Down control register of portH, Address offset: 0x5C"]
    pub PDCRH: u32,
}
#[test]
fn bindgen_test_layout_PWR_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<PWR_TypeDef>(),
        96usize,
        concat!("Size of: ", stringify!(PWR_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<PWR_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(PWR_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CR3 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CR4 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).SR1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(SR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).SR2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(SR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).SCR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).RESERVED as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(RESERVED)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRA as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRA as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRB as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRB as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRC as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRC as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRD as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRD as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRE as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRE as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRF as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRF)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRF as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRF)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRG as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRG as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PUCRH as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PUCRH)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).PDCRH as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(PDCRH)
        )
    );
}
#[doc = " @brief QUAD Serial Peripheral Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct QUADSPI_TypeDef {
    #[doc = "< QUADSPI Control register,                           Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< QUADSPI Device Configuration register,              Address offset: 0x04"]
    pub DCR: u32,
    #[doc = "< QUADSPI Status register,                            Address offset: 0x08"]
    pub SR: u32,
    #[doc = "< QUADSPI Flag Clear register,                        Address offset: 0x0C"]
    pub FCR: u32,
    #[doc = "< QUADSPI Data Length register,                       Address offset: 0x10"]
    pub DLR: u32,
    #[doc = "< QUADSPI Communication Configuration register,       Address offset: 0x14"]
    pub CCR: u32,
    #[doc = "< QUADSPI Address register,                           Address offset: 0x18"]
    pub AR: u32,
    #[doc = "< QUADSPI Alternate Bytes register,                   Address offset: 0x1C"]
    pub ABR: u32,
    #[doc = "< QUADSPI Data register,                              Address offset: 0x20"]
    pub DR: u32,
    #[doc = "< QUADSPI Polling Status Mask register,               Address offset: 0x24"]
    pub PSMKR: u32,
    #[doc = "< QUADSPI Polling Status Match register,              Address offset: 0x28"]
    pub PSMAR: u32,
    #[doc = "< QUADSPI Polling Interval register,                  Address offset: 0x2C"]
    pub PIR: u32,
    #[doc = "< QUADSPI Low Power Timeout register,                 Address offset: 0x30"]
    pub LPTR: u32,
}
#[test]
fn bindgen_test_layout_QUADSPI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<QUADSPI_TypeDef>(),
        52usize,
        concat!("Size of: ", stringify!(QUADSPI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<QUADSPI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(QUADSPI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).DCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(DCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).SR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).FCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(FCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).DLR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(DLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).CCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).AR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(AR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).ABR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(ABR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).DR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).PSMKR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(PSMKR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).PSMAR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(PSMAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).PIR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(PIR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<QUADSPI_TypeDef>())).LPTR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(QUADSPI_TypeDef),
            "::",
            stringify!(LPTR)
        )
    );
}
#[doc = " @brief Reset and Clock Control"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RCC_TypeDef {
    #[doc = "< RCC clock control register,                                              Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< RCC internal clock sources calibration register,                         Address offset: 0x04"]
    pub ICSCR: u32,
    #[doc = "< RCC clock configuration register,                                        Address offset: 0x08"]
    pub CFGR: u32,
    #[doc = "< RCC system PLL configuration register,                                   Address offset: 0x0C"]
    pub PLLCFGR: u32,
    #[doc = "< RCC PLL SAI1 configuration register,                                     Address offset: 0x10"]
    pub PLLSAI1CFGR: u32,
    #[doc = "< RCC PLL SAI2 configuration register,                                     Address offset: 0x14"]
    pub PLLSAI2CFGR: u32,
    #[doc = "< RCC clock interrupt enable register,                                     Address offset: 0x18"]
    pub CIER: u32,
    #[doc = "< RCC clock interrupt flag register,                                       Address offset: 0x1C"]
    pub CIFR: u32,
    #[doc = "< RCC clock interrupt clear register,                                      Address offset: 0x20"]
    pub CICR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x24"]
    pub RESERVED0: u32,
    #[doc = "< RCC AHB1 peripheral reset register,                                      Address offset: 0x28"]
    pub AHB1RSTR: u32,
    #[doc = "< RCC AHB2 peripheral reset register,                                      Address offset: 0x2C"]
    pub AHB2RSTR: u32,
    #[doc = "< RCC AHB3 peripheral reset register,                                      Address offset: 0x30"]
    pub AHB3RSTR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x34"]
    pub RESERVED1: u32,
    #[doc = "< RCC APB1 peripheral reset register 1,                                    Address offset: 0x38"]
    pub APB1RSTR1: u32,
    #[doc = "< RCC APB1 peripheral reset register 2,                                    Address offset: 0x3C"]
    pub APB1RSTR2: u32,
    #[doc = "< RCC APB2 peripheral reset register,                                      Address offset: 0x40"]
    pub APB2RSTR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x44"]
    pub RESERVED2: u32,
    #[doc = "< RCC AHB1 peripheral clocks enable register,                              Address offset: 0x48"]
    pub AHB1ENR: u32,
    #[doc = "< RCC AHB2 peripheral clocks enable register,                              Address offset: 0x4C"]
    pub AHB2ENR: u32,
    #[doc = "< RCC AHB3 peripheral clocks enable register,                              Address offset: 0x50"]
    pub AHB3ENR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x54"]
    pub RESERVED3: u32,
    #[doc = "< RCC APB1 peripheral clocks enable register 1,                            Address offset: 0x58"]
    pub APB1ENR1: u32,
    #[doc = "< RCC APB1 peripheral clocks enable register 2,                            Address offset: 0x5C"]
    pub APB1ENR2: u32,
    #[doc = "< RCC APB2 peripheral clocks enable register,                              Address offset: 0x60"]
    pub APB2ENR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x64"]
    pub RESERVED4: u32,
    #[doc = "< RCC AHB1 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x68"]
    pub AHB1SMENR: u32,
    #[doc = "< RCC AHB2 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x6C"]
    pub AHB2SMENR: u32,
    #[doc = "< RCC AHB3 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x70"]
    pub AHB3SMENR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x74"]
    pub RESERVED5: u32,
    #[doc = "< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1, Address offset: 0x78"]
    pub APB1SMENR1: u32,
    #[doc = "< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2, Address offset: 0x7C"]
    pub APB1SMENR2: u32,
    #[doc = "< RCC APB2 peripheral clocks enable in sleep mode and stop modes register, Address offset: 0x80"]
    pub APB2SMENR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x84"]
    pub RESERVED6: u32,
    #[doc = "< RCC peripherals independent clock configuration register,                Address offset: 0x88"]
    pub CCIPR: u32,
    #[doc = "< Reserved,                                                                Address offset: 0x8C"]
    pub RESERVED7: u32,
    #[doc = "< RCC backup domain control register,                                      Address offset: 0x90"]
    pub BDCR: u32,
    #[doc = "< RCC clock control & status register,                                     Address offset: 0x94"]
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_RCC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<RCC_TypeDef>(),
        152usize,
        concat!("Size of: ", stringify!(RCC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RCC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RCC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).ICSCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(ICSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CFGR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).PLLCFGR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(PLLCFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).PLLSAI1CFGR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(PLLSAI1CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).PLLSAI2CFGR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(PLLSAI2CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CIER as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CIER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CIFR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CIFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CICR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1RSTR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2RSTR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3RSTR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED1 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1RSTR1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1RSTR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1RSTR2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1RSTR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2RSTR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED2 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1ENR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2ENR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3ENR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED3 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1ENR1 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1ENR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1ENR2 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1ENR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2ENR as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED4 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1SMENR as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1SMENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2SMENR as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2SMENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3SMENR as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3SMENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED5 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1SMENR1 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1SMENR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1SMENR2 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1SMENR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2SMENR as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2SMENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED6 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CCIPR as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CCIPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED7 as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).BDCR as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(BDCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CSR as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
}
#[doc = " @brief Real-Time Clock"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RTC_TypeDef {
    #[doc = "< RTC time register,                                         Address offset: 0x00"]
    pub TR: u32,
    #[doc = "< RTC date register,                                         Address offset: 0x04"]
    pub DR: u32,
    #[doc = "< RTC control register,                                      Address offset: 0x08"]
    pub CR: u32,
    #[doc = "< RTC initialization and status register,                    Address offset: 0x0C"]
    pub ISR: u32,
    #[doc = "< RTC prescaler register,                                    Address offset: 0x10"]
    pub PRER: u32,
    #[doc = "< RTC wakeup timer register,                                 Address offset: 0x14"]
    pub WUTR: u32,
    #[doc = "< Reserved"]
    pub reserved: u32,
    #[doc = "< RTC alarm A register,                                      Address offset: 0x1C"]
    pub ALRMAR: u32,
    #[doc = "< RTC alarm B register,                                      Address offset: 0x20"]
    pub ALRMBR: u32,
    #[doc = "< RTC write protection register,                             Address offset: 0x24"]
    pub WPR: u32,
    #[doc = "< RTC sub second register,                                   Address offset: 0x28"]
    pub SSR: u32,
    #[doc = "< RTC shift control register,                                Address offset: 0x2C"]
    pub SHIFTR: u32,
    #[doc = "< RTC time stamp time register,                              Address offset: 0x30"]
    pub TSTR: u32,
    #[doc = "< RTC time stamp date register,                              Address offset: 0x34"]
    pub TSDR: u32,
    #[doc = "< RTC time-stamp sub second register,                        Address offset: 0x38"]
    pub TSSSR: u32,
    #[doc = "< RTC calibration register,                                  Address offset: 0x3C"]
    pub CALR: u32,
    #[doc = "< RTC tamper configuration register,                         Address offset: 0x40"]
    pub TAMPCR: u32,
    #[doc = "< RTC alarm A sub second register,                           Address offset: 0x44"]
    pub ALRMASSR: u32,
    #[doc = "< RTC alarm B sub second register,                           Address offset: 0x48"]
    pub ALRMBSSR: u32,
    #[doc = "< RTC option register,                                       Address offset: 0x4C"]
    pub OR: u32,
    #[doc = "< RTC backup register 0,                                     Address offset: 0x50"]
    pub BKP0R: u32,
    #[doc = "< RTC backup register 1,                                     Address offset: 0x54"]
    pub BKP1R: u32,
    #[doc = "< RTC backup register 2,                                     Address offset: 0x58"]
    pub BKP2R: u32,
    #[doc = "< RTC backup register 3,                                     Address offset: 0x5C"]
    pub BKP3R: u32,
    #[doc = "< RTC backup register 4,                                     Address offset: 0x60"]
    pub BKP4R: u32,
    #[doc = "< RTC backup register 5,                                     Address offset: 0x64"]
    pub BKP5R: u32,
    #[doc = "< RTC backup register 6,                                     Address offset: 0x68"]
    pub BKP6R: u32,
    #[doc = "< RTC backup register 7,                                     Address offset: 0x6C"]
    pub BKP7R: u32,
    #[doc = "< RTC backup register 8,                                     Address offset: 0x70"]
    pub BKP8R: u32,
    #[doc = "< RTC backup register 9,                                     Address offset: 0x74"]
    pub BKP9R: u32,
    #[doc = "< RTC backup register 10,                                    Address offset: 0x78"]
    pub BKP10R: u32,
    #[doc = "< RTC backup register 11,                                    Address offset: 0x7C"]
    pub BKP11R: u32,
    #[doc = "< RTC backup register 12,                                    Address offset: 0x80"]
    pub BKP12R: u32,
    #[doc = "< RTC backup register 13,                                    Address offset: 0x84"]
    pub BKP13R: u32,
    #[doc = "< RTC backup register 14,                                    Address offset: 0x88"]
    pub BKP14R: u32,
    #[doc = "< RTC backup register 15,                                    Address offset: 0x8C"]
    pub BKP15R: u32,
    #[doc = "< RTC backup register 16,                                    Address offset: 0x90"]
    pub BKP16R: u32,
    #[doc = "< RTC backup register 17,                                    Address offset: 0x94"]
    pub BKP17R: u32,
    #[doc = "< RTC backup register 18,                                    Address offset: 0x98"]
    pub BKP18R: u32,
    #[doc = "< RTC backup register 19,                                    Address offset: 0x9C"]
    pub BKP19R: u32,
    #[doc = "< RTC backup register 20,                                    Address offset: 0xA0"]
    pub BKP20R: u32,
    #[doc = "< RTC backup register 21,                                    Address offset: 0xA4"]
    pub BKP21R: u32,
    #[doc = "< RTC backup register 22,                                    Address offset: 0xA8"]
    pub BKP22R: u32,
    #[doc = "< RTC backup register 23,                                    Address offset: 0xAC"]
    pub BKP23R: u32,
    #[doc = "< RTC backup register 24,                                    Address offset: 0xB0"]
    pub BKP24R: u32,
    #[doc = "< RTC backup register 25,                                    Address offset: 0xB4"]
    pub BKP25R: u32,
    #[doc = "< RTC backup register 26,                                    Address offset: 0xB8"]
    pub BKP26R: u32,
    #[doc = "< RTC backup register 27,                                    Address offset: 0xBC"]
    pub BKP27R: u32,
    #[doc = "< RTC backup register 28,                                    Address offset: 0xC0"]
    pub BKP28R: u32,
    #[doc = "< RTC backup register 29,                                    Address offset: 0xC4"]
    pub BKP29R: u32,
    #[doc = "< RTC backup register 30,                                    Address offset: 0xC8"]
    pub BKP30R: u32,
    #[doc = "< RTC backup register 31,                                    Address offset: 0xCC"]
    pub BKP31R: u32,
}
#[test]
fn bindgen_test_layout_RTC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<RTC_TypeDef>(),
        208usize,
        concat!("Size of: ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RTC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).DR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).CR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ISR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).PRER as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(PRER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).WUTR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WUTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).reserved as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMAR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMBR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).WPR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).SSR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).SHIFTR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SHIFTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSTR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSDR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSSSR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSSSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).CALR as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CALR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TAMPCR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TAMPCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMASSR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMASSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMBSSR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBSSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).OR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(OR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP0R as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP0R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP1R as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP2R as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP2R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP3R as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP3R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP4R as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP4R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP5R as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP5R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP6R as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP6R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP7R as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP7R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP8R as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP8R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP9R as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP9R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP10R as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP10R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP11R as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP11R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP12R as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP12R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP13R as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP13R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP14R as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP14R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP15R as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP15R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP16R as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP16R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP17R as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP17R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP18R as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP18R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP19R as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP19R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP20R as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP20R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP21R as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP21R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP22R as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP22R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP23R as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP23R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP24R as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP24R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP25R as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP25R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP26R as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP26R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP27R as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP27R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP28R as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP28R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP29R as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP29R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP30R as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP30R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP31R as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP31R)
        )
    );
}
#[doc = " @brief Serial Audio Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SAI_TypeDef {
    #[doc = "< SAI global configuration register,        Address offset: 0x00"]
    pub GCR: u32,
}
#[test]
fn bindgen_test_layout_SAI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SAI_TypeDef>(),
        4usize,
        concat!("Size of: ", stringify!(SAI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SAI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SAI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_TypeDef>())).GCR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_TypeDef),
            "::",
            stringify!(GCR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SAI_Block_TypeDef {
    #[doc = "< SAI block x configuration register 1,     Address offset: 0x04"]
    pub CR1: u32,
    #[doc = "< SAI block x configuration register 2,     Address offset: 0x08"]
    pub CR2: u32,
    #[doc = "< SAI block x frame configuration register, Address offset: 0x0C"]
    pub FRCR: u32,
    #[doc = "< SAI block x slot register,                Address offset: 0x10"]
    pub SLOTR: u32,
    #[doc = "< SAI block x interrupt mask register,      Address offset: 0x14"]
    pub IMR: u32,
    #[doc = "< SAI block x status register,              Address offset: 0x18"]
    pub SR: u32,
    #[doc = "< SAI block x clear flag register,          Address offset: 0x1C"]
    pub CLRFR: u32,
    #[doc = "< SAI block x data register,                Address offset: 0x20"]
    pub DR: u32,
}
#[test]
fn bindgen_test_layout_SAI_Block_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SAI_Block_TypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(SAI_Block_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SAI_Block_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SAI_Block_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).FRCR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(FRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).SLOTR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(SLOTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).IMR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(IMR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).SR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).CLRFR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(CLRFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SAI_Block_TypeDef>())).DR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SAI_Block_TypeDef),
            "::",
            stringify!(DR)
        )
    );
}
#[doc = " @brief Secure digital input/output Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDMMC_TypeDef {
    #[doc = "< SDMMC power control register,    Address offset: 0x00"]
    pub POWER: u32,
    #[doc = "< SDMMC clock control register,    Address offset: 0x04"]
    pub CLKCR: u32,
    #[doc = "< SDMMC argument register,         Address offset: 0x08"]
    pub ARG: u32,
    #[doc = "< SDMMC command register,          Address offset: 0x0C"]
    pub CMD: u32,
    #[doc = "< SDMMC command response register, Address offset: 0x10"]
    pub RESPCMD: u32,
    #[doc = "< SDMMC response 1 register,       Address offset: 0x14"]
    pub RESP1: u32,
    #[doc = "< SDMMC response 2 register,       Address offset: 0x18"]
    pub RESP2: u32,
    #[doc = "< SDMMC response 3 register,       Address offset: 0x1C"]
    pub RESP3: u32,
    #[doc = "< SDMMC response 4 register,       Address offset: 0x20"]
    pub RESP4: u32,
    #[doc = "< SDMMC data timer register,       Address offset: 0x24"]
    pub DTIMER: u32,
    #[doc = "< SDMMC data length register,      Address offset: 0x28"]
    pub DLEN: u32,
    #[doc = "< SDMMC data control register,     Address offset: 0x2C"]
    pub DCTRL: u32,
    #[doc = "< SDMMC data counter register,     Address offset: 0x30"]
    pub DCOUNT: u32,
    #[doc = "< SDMMC status register,           Address offset: 0x34"]
    pub STA: u32,
    #[doc = "< SDMMC interrupt clear register,  Address offset: 0x38"]
    pub ICR: u32,
    #[doc = "< SDMMC mask register,             Address offset: 0x3C"]
    pub MASK: u32,
    #[doc = "< Reserved, 0x40-0x44"]
    pub RESERVED0: [u32; 2usize],
    #[doc = "< SDMMC FIFO counter register,     Address offset: 0x48"]
    pub FIFOCNT: u32,
    #[doc = "< Reserved, 0x4C-0x7C"]
    pub RESERVED1: [u32; 13usize],
    #[doc = "< SDMMC data FIFO register,        Address offset: 0x80"]
    pub FIFO: u32,
}
#[test]
fn bindgen_test_layout_SDMMC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SDMMC_TypeDef>(),
        132usize,
        concat!("Size of: ", stringify!(SDMMC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SDMMC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SDMMC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).POWER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(POWER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).CLKCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(CLKCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).ARG as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(ARG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).CMD as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(CMD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESPCMD as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESPCMD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESP1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESP2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESP3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESP4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESP4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).DTIMER as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DTIMER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).DLEN as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DLEN)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).DCTRL as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).DCOUNT as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(DCOUNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).STA as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(STA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).ICR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).MASK as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(MASK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESERVED0 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).FIFOCNT as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(FIFOCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).RESERVED1 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDMMC_TypeDef>())).FIFO as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SDMMC_TypeDef),
            "::",
            stringify!(FIFO)
        )
    );
}
#[doc = " @brief Serial Peripheral Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SPI_TypeDef {
    #[doc = "< SPI Control register 1,                              Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< SPI Control register 2,                              Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< SPI Status register,                                 Address offset: 0x08"]
    pub SR: u32,
    #[doc = "< SPI data register,                                   Address offset: 0x0C"]
    pub DR: u32,
    #[doc = "< SPI CRC polynomial register,                         Address offset: 0x10"]
    pub CRCPR: u32,
    #[doc = "< SPI Rx CRC register,                                 Address offset: 0x14"]
    pub RXCRCR: u32,
    #[doc = "< SPI Tx CRC register,                                 Address offset: 0x18"]
    pub TXCRCR: u32,
}
#[test]
fn bindgen_test_layout_SPI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SPI_TypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SPI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).SR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).DR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CRCPR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CRCPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).RXCRCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RXCRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).TXCRCR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(TXCRCR)
        )
    );
}
#[doc = " @brief Single Wire Protocol Master Interface SPWMI"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SWPMI_TypeDef {
    #[doc = "< SWPMI Configuration/Control register,     Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< SWPMI bitrate register,                   Address offset: 0x04"]
    pub BRR: u32,
    #[doc = "< Reserved, 0x08"]
    pub RESERVED1: u32,
    #[doc = "< SWPMI Interrupt and Status register,      Address offset: 0x0C"]
    pub ISR: u32,
    #[doc = "< SWPMI Interrupt Flag Clear register,      Address offset: 0x10"]
    pub ICR: u32,
    #[doc = "< SWPMI Interrupt Enable register,          Address offset: 0x14"]
    pub IER: u32,
    #[doc = "< SWPMI Receive Frame Length register,      Address offset: 0x18"]
    pub RFL: u32,
    #[doc = "< SWPMI Transmit data register,             Address offset: 0x1C"]
    pub TDR: u32,
    #[doc = "< SWPMI Receive data register,              Address offset: 0x20"]
    pub RDR: u32,
    #[doc = "< SWPMI Option register,                    Address offset: 0x24"]
    pub OR: u32,
}
#[test]
fn bindgen_test_layout_SWPMI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SWPMI_TypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(SWPMI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SWPMI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SWPMI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).BRR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(BRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).RESERVED1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).ISR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).ICR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).IER as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).RFL as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(RFL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).TDR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(TDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).RDR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(RDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SWPMI_TypeDef>())).OR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SWPMI_TypeDef),
            "::",
            stringify!(OR)
        )
    );
}
#[doc = " @brief System configuration controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SYSCFG_TypeDef {
    #[doc = "< SYSCFG memory remap register,                      Address offset: 0x00"]
    pub MEMRMP: u32,
    #[doc = "< SYSCFG configuration register 1,                   Address offset: 0x04"]
    pub CFGR1: u32,
    #[doc = "< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14"]
    pub EXTICR: [u32; 4usize],
    #[doc = "< SYSCFG SRAM2 control and status register,          Address offset: 0x18"]
    pub SCSR: u32,
    #[doc = "< SYSCFG configuration register 2,                   Address offset: 0x1C"]
    pub CFGR2: u32,
    #[doc = "< SYSCFG SRAM2 write protection register,            Address offset: 0x20"]
    pub SWPR: u32,
    #[doc = "< SYSCFG SRAM2 key register,                         Address offset: 0x24"]
    pub SKR: u32,
}
#[test]
fn bindgen_test_layout_SYSCFG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SYSCFG_TypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(SYSCFG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SYSCFG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SYSCFG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).MEMRMP as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(MEMRMP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).CFGR1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(CFGR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).EXTICR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(EXTICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).SCSR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(SCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).CFGR2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(CFGR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).SWPR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(SWPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).SKR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(SKR)
        )
    );
}
#[doc = " @brief TIM"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TIM_TypeDef {
    #[doc = "< TIM control register 1,                   Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< TIM control register 2,                   Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< TIM slave mode control register,          Address offset: 0x08"]
    pub SMCR: u32,
    #[doc = "< TIM DMA/interrupt enable register,        Address offset: 0x0C"]
    pub DIER: u32,
    #[doc = "< TIM status register,                      Address offset: 0x10"]
    pub SR: u32,
    #[doc = "< TIM event generation register,            Address offset: 0x14"]
    pub EGR: u32,
    #[doc = "< TIM capture/compare mode register 1,      Address offset: 0x18"]
    pub CCMR1: u32,
    #[doc = "< TIM capture/compare mode register 2,      Address offset: 0x1C"]
    pub CCMR2: u32,
    #[doc = "< TIM capture/compare enable register,      Address offset: 0x20"]
    pub CCER: u32,
    #[doc = "< TIM counter register,                     Address offset: 0x24"]
    pub CNT: u32,
    #[doc = "< TIM prescaler,                            Address offset: 0x28"]
    pub PSC: u32,
    #[doc = "< TIM auto-reload register,                 Address offset: 0x2C"]
    pub ARR: u32,
    #[doc = "< TIM repetition counter register,          Address offset: 0x30"]
    pub RCR: u32,
    #[doc = "< TIM capture/compare register 1,           Address offset: 0x34"]
    pub CCR1: u32,
    #[doc = "< TIM capture/compare register 2,           Address offset: 0x38"]
    pub CCR2: u32,
    #[doc = "< TIM capture/compare register 3,           Address offset: 0x3C"]
    pub CCR3: u32,
    #[doc = "< TIM capture/compare register 4,           Address offset: 0x40"]
    pub CCR4: u32,
    #[doc = "< TIM break and dead-time register,         Address offset: 0x44"]
    pub BDTR: u32,
    #[doc = "< TIM DMA control register,                 Address offset: 0x48"]
    pub DCR: u32,
    #[doc = "< TIM DMA address for full transfer,        Address offset: 0x4C"]
    pub DMAR: u32,
    #[doc = "< TIM option register 1,                    Address offset: 0x50"]
    pub OR1: u32,
    #[doc = "< TIM capture/compare mode register 3,      Address offset: 0x54"]
    pub CCMR3: u32,
    #[doc = "< TIM capture/compare register5,            Address offset: 0x58"]
    pub CCR5: u32,
    #[doc = "< TIM capture/compare register6,            Address offset: 0x5C"]
    pub CCR6: u32,
    #[doc = "< TIM option register 2,                    Address offset: 0x60"]
    pub OR2: u32,
    #[doc = "< TIM option register 3,                    Address offset: 0x64"]
    pub OR3: u32,
}
#[test]
fn bindgen_test_layout_TIM_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<TIM_TypeDef>(),
        104usize,
        concat!("Size of: ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<TIM_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).SMCR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SMCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DIER as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DIER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).SR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).EGR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(EGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCMR1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCMR2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCER as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CNT as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).PSC as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(PSC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).ARR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(ARR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).RCR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(RCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR1 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR2 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR3 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR4 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).BDTR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(BDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DCR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DMAR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DMAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).OR1 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(OR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCMR3 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR5 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR6 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).OR2 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(OR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).OR3 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(OR3)
        )
    );
}
#[doc = " @brief Touch Sensing Controller (TSC)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TSC_TypeDef {
    #[doc = "< TSC control register,                                     Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< TSC interrupt enable register,                            Address offset: 0x04"]
    pub IER: u32,
    #[doc = "< TSC interrupt clear register,                             Address offset: 0x08"]
    pub ICR: u32,
    #[doc = "< TSC interrupt status register,                            Address offset: 0x0C"]
    pub ISR: u32,
    #[doc = "< TSC I/O hysteresis control register,                      Address offset: 0x10"]
    pub IOHCR: u32,
    #[doc = "< Reserved,                                                 Address offset: 0x14"]
    pub RESERVED1: u32,
    #[doc = "< TSC I/O analog switch control register,                   Address offset: 0x18"]
    pub IOASCR: u32,
    #[doc = "< Reserved,                                                 Address offset: 0x1C"]
    pub RESERVED2: u32,
    #[doc = "< TSC I/O sampling control register,                        Address offset: 0x20"]
    pub IOSCR: u32,
    #[doc = "< Reserved,                                                 Address offset: 0x24"]
    pub RESERVED3: u32,
    #[doc = "< TSC I/O channel control register,                         Address offset: 0x28"]
    pub IOCCR: u32,
    #[doc = "< Reserved,                                                 Address offset: 0x2C"]
    pub RESERVED4: u32,
    #[doc = "< TSC I/O group control status register,                    Address offset: 0x30"]
    pub IOGCSR: u32,
    #[doc = "< TSC I/O group x counter register,                         Address offset: 0x34-50"]
    pub IOGXCR: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_TSC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<TSC_TypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(TSC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<TSC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(TSC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IER as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).ICR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).ISR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOHCR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOHCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).RESERVED1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOASCR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOASCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).RESERVED2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOSCR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).RESERVED3 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOCCR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOCCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).RESERVED4 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOGCSR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOGCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TSC_TypeDef>())).IOGXCR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TSC_TypeDef),
            "::",
            stringify!(IOGXCR)
        )
    );
}
#[doc = " @brief Universal Synchronous Asynchronous Receiver Transmitter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USART_TypeDef {
    #[doc = "< USART Control register 1,                 Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< USART Control register 2,                 Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< USART Control register 3,                 Address offset: 0x08"]
    pub CR3: u32,
    #[doc = "< USART Baud rate register,                 Address offset: 0x0C"]
    pub BRR: u32,
    #[doc = "< USART Guard time and prescaler register,  Address offset: 0x10"]
    pub GTPR: u16,
    #[doc = "< Reserved, 0x12"]
    pub RESERVED2: u16,
    #[doc = "< USART Receiver Time Out register,         Address offset: 0x14"]
    pub RTOR: u32,
    #[doc = "< USART Request register,                   Address offset: 0x18"]
    pub RQR: u16,
    #[doc = "< Reserved, 0x1A"]
    pub RESERVED3: u16,
    #[doc = "< USART Interrupt and status register,      Address offset: 0x1C"]
    pub ISR: u32,
    #[doc = "< USART Interrupt flag Clear register,      Address offset: 0x20"]
    pub ICR: u32,
    #[doc = "< USART Receive Data register,              Address offset: 0x24"]
    pub RDR: u16,
    #[doc = "< Reserved, 0x26"]
    pub RESERVED4: u16,
    #[doc = "< USART Transmit Data register,             Address offset: 0x28"]
    pub TDR: u16,
    #[doc = "< Reserved, 0x2A"]
    pub RESERVED5: u16,
}
#[test]
fn bindgen_test_layout_USART_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USART_TypeDef>(),
        44usize,
        concat!("Size of: ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USART_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR3 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).BRR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(BRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).GTPR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(GTPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RESERVED2 as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RTOR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RTOR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RQR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RQR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RESERVED3 as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).ISR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).ICR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RDR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RESERVED4 as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).TDR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(TDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).RESERVED5 as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
}
#[doc = " @brief VREFBUF"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VREFBUF_TypeDef {
    #[doc = "< VREFBUF control and status register,         Address offset: 0x00"]
    pub CSR: u32,
    #[doc = "< VREFBUF calibration and control register,    Address offset: 0x04"]
    pub CCR: u32,
}
#[test]
fn bindgen_test_layout_VREFBUF_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<VREFBUF_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(VREFBUF_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<VREFBUF_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(VREFBUF_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<VREFBUF_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VREFBUF_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<VREFBUF_TypeDef>())).CCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VREFBUF_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
}
#[doc = " @brief Window WATCHDOG"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct WWDG_TypeDef {
    #[doc = "< WWDG Control register,       Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< WWDG Configuration register, Address offset: 0x04"]
    pub CFR: u32,
    #[doc = "< WWDG Status register,        Address offset: 0x08"]
    pub SR: u32,
}
#[test]
fn bindgen_test_layout_WWDG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<WWDG_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<WWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).CFR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).SR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
}
#[doc = " @brief RNG"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RNG_TypeDef {
    #[doc = "< RNG control register, Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< RNG status register,  Address offset: 0x04"]
    pub SR: u32,
    #[doc = "< RNG data register,    Address offset: 0x08"]
    pub DR: u32,
}
#[test]
fn bindgen_test_layout_RNG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<RNG_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(RNG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RNG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RNG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RNG_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RNG_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RNG_TypeDef>())).SR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RNG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RNG_TypeDef>())).DR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RNG_TypeDef),
            "::",
            stringify!(DR)
        )
    );
}
#[doc = " @brief USB_OTG_Core_register"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct USB_OTG_GlobalTypeDef {
    #[doc = "<  USB_OTG Control and Status Register          000h"]
    pub GOTGCTL: u32,
    #[doc = "<  USB_OTG Interrupt Register                   004h"]
    pub GOTGINT: u32,
    #[doc = "<  Core AHB Configuration Register              008h"]
    pub GAHBCFG: u32,
    #[doc = "<  Core USB Configuration Register              00Ch"]
    pub GUSBCFG: u32,
    #[doc = "<  Core Reset Register                          010h"]
    pub GRSTCTL: u32,
    #[doc = "<  Core Interrupt Register                      014h"]
    pub GINTSTS: u32,
    #[doc = "<  Core Interrupt Mask Register                 018h"]
    pub GINTMSK: u32,
    #[doc = "<  Receive Sts Q Read Register                  01Ch"]
    pub GRXSTSR: u32,
    #[doc = "<  Receive Sts Q Read & POP Register            020h"]
    pub GRXSTSP: u32,
    #[doc = "<  Receive FIFO Size Register                   024h"]
    pub GRXFSIZ: u32,
    #[doc = "<  EP0 / Non Periodic Tx FIFO Size Register     028h"]
    pub DIEPTXF0_HNPTXFSIZ: u32,
    #[doc = "<  Non Periodic Tx FIFO/Queue Sts reg           02Ch"]
    pub HNPTXSTS: u32,
    #[doc = "<  Reserved                                     030h"]
    pub Reserved30: [u32; 2usize],
    #[doc = "<  General Purpose IO Register                  038h"]
    pub GCCFG: u32,
    #[doc = "<  User ID Register                             03Ch"]
    pub CID: u32,
    #[doc = "<  USB_OTG core ID                              040h"]
    pub GSNPSID: u32,
    #[doc = "<  User HW config1                              044h"]
    pub GHWCFG1: u32,
    #[doc = "<  User HW config2                              048h"]
    pub GHWCFG2: u32,
    #[doc = "<  User HW config3                              04Ch"]
    pub GHWCFG3: u32,
    #[doc = "<  Reserved                                     050h"]
    pub Reserved6: u32,
    #[doc = "<  LPM Register                                 054h"]
    pub GLPMCFG: u32,
    #[doc = "<  Power Down Register                          058h"]
    pub GPWRDN: u32,
    #[doc = "<  DFIFO Software Config Register               05Ch"]
    pub GDFIFOCFG: u32,
    #[doc = "<  ADP Timer, Control and Status Register       060h"]
    pub GADPCTL: u32,
    #[doc = "<  Reserved                                064h-0FFh"]
    pub Reserved43: [u32; 39usize],
    #[doc = "<  Host Periodic Tx FIFO Size Reg               100h"]
    pub HPTXFSIZ: u32,
    #[doc = "<  dev Periodic Transmit FIFO"]
    pub DIEPTXF: [u32; 15usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_GlobalTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_GlobalTypeDef>(),
        320usize,
        concat!("Size of: ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_GlobalTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GOTGCTL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GOTGINT as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GAHBCFG as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GAHBCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GUSBCFG as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GUSBCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRSTCTL as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRSTCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GINTSTS as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTSTS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GINTMSK as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXSTSR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXSTSP as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXFSIZ as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXFSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).DIEPTXF0_HNPTXFSIZ as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF0_HNPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).HNPTXSTS as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HNPTXSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).Reserved30 as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved30)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GCCFG as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GCCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).CID as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(CID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GSNPSID as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GSNPSID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GHWCFG1 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GHWCFG2 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GHWCFG3 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GHWCFG3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).Reserved6 as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GLPMCFG as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GLPMCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GPWRDN as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GPWRDN)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GDFIFOCFG as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GDFIFOCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GADPCTL as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GADPCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).Reserved43 as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved43)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).HPTXFSIZ as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).DIEPTXF as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF)
        )
    );
}
impl Default for USB_OTG_GlobalTypeDef {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief USB_OTG_device_Registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USB_OTG_DeviceTypeDef {
    pub DCFG: u32,
    pub DCTL: u32,
    pub DSTS: u32,
    pub Reserved0C: u32,
    pub DIEPMSK: u32,
    pub DOEPMSK: u32,
    pub DAINT: u32,
    pub DAINTMSK: u32,
    pub Reserved20: u32,
    pub Reserved24: u32,
    pub DVBUSDIS: u32,
    pub DVBUSPULSE: u32,
    pub DTHRCTL: u32,
    pub DIEPEMPMSK: u32,
    pub DEACHINT: u32,
    pub DEACHMSK: u32,
    pub Reserved40: u32,
    pub DINEP1MSK: u32,
    pub Reserved44: [u32; 15usize],
    pub DOUTEP1MSK: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_DeviceTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_DeviceTypeDef>(),
        136usize,
        concat!("Size of: ", stringify!(USB_OTG_DeviceTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_DeviceTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_DeviceTypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DCFG as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DCTL as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DSTS as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DIEPMSK as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DIEPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DOEPMSK as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DOEPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DAINT as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DAINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DAINTMSK as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DAINTMSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved20 as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved20)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved24 as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved24)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DVBUSDIS as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DVBUSDIS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DVBUSPULSE as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DVBUSPULSE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DTHRCTL as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DTHRCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DIEPEMPMSK as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DIEPEMPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DEACHINT as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DEACHINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DEACHMSK as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DEACHMSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved40 as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved40)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DINEP1MSK as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DINEP1MSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved44 as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved44)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DOUTEP1MSK as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DOUTEP1MSK)
        )
    );
}
#[doc = " @brief USB_OTG_IN_Endpoint-Specific_Register"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USB_OTG_INEndpointTypeDef {
    pub DIEPCTL: u32,
    pub Reserved04: u32,
    pub DIEPINT: u32,
    pub Reserved0C: u32,
    pub DIEPTSIZ: u32,
    pub DIEPDMA: u32,
    pub DTXFSTS: u32,
    pub Reserved18: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_INEndpointTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_INEndpointTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(USB_OTG_INEndpointTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_INEndpointTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_INEndpointTypeDef))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPCTL as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved04 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved04)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPINT as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPINT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPTSIZ as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPTSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPDMA as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPDMA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DTXFSTS as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DTXFSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved18 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved18)
        )
    );
}
#[doc = " @brief USB_OTG_OUT_Endpoint-Specific_Registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USB_OTG_OUTEndpointTypeDef {
    pub DOEPCTL: u32,
    pub Reserved04: u32,
    pub DOEPINT: u32,
    pub Reserved0C: u32,
    pub DOEPTSIZ: u32,
    pub DOEPDMA: u32,
    pub Reserved18: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_OUTEndpointTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_OUTEndpointTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(USB_OTG_OUTEndpointTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_OUTEndpointTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_OUTEndpointTypeDef))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPCTL as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).Reserved04 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(Reserved04)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPINT as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPINT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPTSIZ as *const _ as usize
        },
